# Project 1: Explanatory Data Analysis & Data Presentation (Movies Dataset)

# Project Brief for Self-Coders

Here you´ll have the opportunity to code major parts of Project 1 on your own. If you need any help or inspiration, have a look at the Videos or the Jupyter Notebook with the full code. <br> <br>
Keep in mind that it´s all about __getting the right results/conclusions__. It´s not about finding the identical code. Things can be coded in many different ways. Even if you come to the same conclusions, it´s very unlikely that we have the very same code.

## Data Import and first Inspection

1. __Import__ the movies dataset from the CSV file "movies_complete.csv". __Inspect__ the data.

__Some additional information on Features/Columns__:

* **id:** The ID of the movie (clear/unique identifier).
* **title:** The Official Title of the movie.
* **tagline:** The tagline of the movie.
* **release_date:** Theatrical Release Date of the movie.
* **genres:** Genres associated with the movie.
* **belongs_to_collection:** Gives information on the movie series/franchise the particular film belongs to.
* **original_language:** The language in which the movie was originally shot in.
* **budget_musd:** The budget of the movie in million dollars.
* **revenue_musd:** The total revenue of the movie in million dollars.
* **production_companies:** Production companies involved with the making of the movie.
* **production_countries:** Countries where the movie was shot/produced in.
* **vote_count:** The number of votes by users, as counted by TMDB.
* **vote_average:** The average rating of the movie.
* **popularity:** The Popularity Score assigned by TMDB.
* **runtime:** The runtime of the movie in minutes.
* **overview:** A brief blurb of the movie.
* **spoken_languages:** Spoken languages in the film.
* **poster_path:** The URL of the poster image.
* **cast:** (Main) Actors appearing in the movie.
* **cast_size:** number of Actors appearing in the movie.
* **director:** Director of the movie.
* **crew_size:** Size of the film crew (incl. director, excl. actors).

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('movies_complete.csv')

In [10]:
pd.options.display.max_columns = 30
df.head()

,id,title,tagline,release_date,genres,belongs_to_collection,original_language,budget_musd,revenue_musd,production_companies,production_countries,vote_count,vote_average,popularity,runtime,overview,spoken_languages,poster_path,cast,cast_size,crew_size,director
0,862,Toy Story,NaN,1995-10-30,Animation|Comedy|Family,Toy Story Collection,en,30.0,373.554033,Pixar Animation Studios,United States of America,5415.0,7.7,21.946943,81.0,"Led by Woody, Andy's toys live happily in his ...",English,<img src='http://image.tmdb.org/t/p/w185//uXDf...,Tom Hanks|Tim Allen|Don Rickles|Jim Varney|Wal...,13,106,John Lasseter
1,8844,Jumanji,Roll the dice and unleash the excitement!,1995-12-15,Adventure|Fantasy|Family,NaN,en,65.0,262.797249,TriStar Pictures|Teitler Film|Interscope Commu...,United States of America,2413.0,6.9,17.015539,104.0,When siblings Judy and Peter discover an encha...,English|Français,<img src='http://image.tmdb.org/t/p/w185//vgpX...,Robin Williams|Jonathan Hyde|Kirsten Dunst|Bra...,26,16,Joe Johnston
2,15602,Grumpier Old Men,Still Yelling. Still Fighting. Still Ready for...,1995-12-22,Romance|Comedy,Grumpy Old Men Collection,en,NaN,NaN,Warner Bros.|Lancaster Gate,United States of America,92.0,6.5,11.712900,101.0,A family wedding reignites the ancient feud be...,English,<img src='http://image.tmdb.org/t/p/w185//1FSX...,Walter Matthau|Jack Lemmon|Ann-Margret|Sophia ...,7,4,Howard Deutch
3,31357,Waiting to Exhale,Friends are the people who let you be yourself...,1995-12-22,Comedy|Drama|Romance,NaN,en,16.0,81.452156,Twentieth Century Fox Film Corporation,United States of America,34.0,6.1,3.859495,127.0,"Cheated on, mistreated and stepped on, the wom...",English,<img src='http://image.tmdb.org/t/p/w185//4wjG...,Whitney Houston|Angela Bassett|Loretta Devine|...,10,10,Forest Whitaker
4,11862,Father of the Bride Part II,Just When His World Is Back To Normal... He's ...,1995-02-10,Comedy,Father of the Bride Collection,en,NaN,76.578911,Sandollar Productions|Touchstone Pictures,United States of America,173.0,5.7,8.387519,106.0,Just when George Banks has recovered from his ...,English,<img src='http://image.tmdb.org/t/p/w185//lf9R...,Steve Martin|Diane Keaton|Martin Short|Kimberl...,12,7,Charles Shyer

## The best and the worst movies...

2. __Filter__ the Dataset and __find the best/worst n Movies__ with the

- Highest Revenue
- Highest Budget
- Highest Profit (=Revenue - Budget)
- Lowest Profit (=Revenue - Budget)
- Highest Return on Investment (=Revenue / Budget) (only movies with Budget >= 10) 
- Lowest Return on Investment (=Revenue / Budget) (only movies with Budget >= 10)
- Highest number of Votes
- Highest Rating (only movies with 10 or more Ratings)
- Lowest Rating (only movies with 10 or more Ratings)
- Highest Popularity

__Define__ an appropriate __user-defined function__ to reuse code.

In [8]:
def custom_sort(column, ascending_true, output_count=5):
    df_output = df.sort_values(by=column, ascending=ascending_true)[0:output_count]
    return df_output

__Movies Top 5 - Highest Revenue__

In [ ]:
# Highest revenue
custom_sort('revenue_musd', False, 5)

In [ ]:
# Lowest revenue
custom_sort('revenue_musd', True, 5)

__Movies Top 5 - Highest Budget__

In [ ]:
# Highest budget
custom_sort('budget_musd', False, 5)

__Movies Top 5 - Highest Profit__

In [ ]:
# Highest profit
df['profit'] = df['revenue_musd'] - df['budget_musd']
custom_sort('profit', False, 5)

__Movies Top 5 - Lowest Profit__

In [ ]:
custom_sort('profit', True, 5)

__Movies Top 5 - Highest ROI__

In [ ]:
# Highest profit
df['ROI'] = df['revenue_musd'] / df['budget_musd']
custom_sort('ROI', False, 5)

__Movies Top 5 - Lowest ROI__

In [ ]:
custom_sort('ROI', True, 5)

__Movies Top 5 - Most Votes__

__Movies Top 5 - Highest Rating__

__Movies Top 5 - Lowest Rating__

__Movies Top 5 - Most Popular__

## Find your next Movie

3. __Filter__ the Dataset for movies that meet the following conditions:

__Search 1: Science Fiction Action Movie with Bruce Willis (sorted from high to low Rating)__

__Search 2: Movies with Uma Thurman and directed by Quentin Tarantino (sorted from short to long runtime)__

__Search 3: Most Successful Pixar Studio Movies between 2010 and 2015 (sorted from high to low Revenue)__

__Search 4: Action or Thriller Movie with original language English and minimum Rating of 7.5 (most recent movies first)__

In [19]:
df.columns

Index(['id', 'title', 'tagline', 'release_date', 'genres',
       'belongs_to_collection', 'original_language', 'budget_musd',
       'revenue_musd', 'production_companies', 'production_countries',
       'vote_count', 'vote_average', 'popularity', 'runtime', 'overview',
       'spoken_languages', 'poster_path', 'cast', 'cast_size', 'crew_size',
       'director', 'profit', 'ROI'],
      dtype='object')

In [ ]:
df[(df['genres'].str.contains('Science Fiction')) & (df['genres'].str.contains('Action')) & (df['cast'].str.contains('Bruce Willis'))].sort_values(by='vote_average', ascending=False)

## Are Franchises more successful?

4. __Analyze__ the Dataset and __find out whether Franchises (Movies that belong to a collection) are more successful than stand-alone movies__ in terms of:

- mean revenue
- median Return on Investment
- mean budget raised
- mean popularity
- mean rating

hint: use groupby()

__Franchise vs. Stand-alone: Average Revenue__

In [31]:
import numpy as np
df['part_of_franchise'] = np.where(df.belongs_to_collection.isnull() == True, 'no', 'yes')

part_of_franchise
no     40228
yes     4463
Name: count, dtype: int64

In [32]:
df.groupby('part_of_franchise').agg({'revenue_musd':'mean'}).reset_index(drop=False).sort_values(by='revenue_musd', ascending=False)

  part_of_franchise  revenue_musd
1               yes    165.708193
0                no     44.742814

__Franchise vs. Stand-alone: Return on Investment / Profitability (median)__

In [34]:
df.groupby('part_of_franchise').agg({'profit':'mean'}).reset_index(drop=False).sort_values(by='profit', ascending=False)

  part_of_franchise      profit
1               yes  148.878982
0                no   32.950649

__Franchise vs. Stand-alone: Average Budget__

In [35]:
df.groupby('part_of_franchise').agg({'budget_musd':'mean'}).reset_index(drop=False).sort_values(by='budget_musd', ascending=False)

  part_of_franchise  budget_musd
1               yes    38.319847
0                no    18.047741

__Franchise vs. Stand-alone: Average Popularity__

In [36]:
df.groupby('part_of_franchise').agg({'popularity':'mean'}).reset_index(drop=False).sort_values(by='popularity', ascending=False)

  part_of_franchise  popularity
1               yes    6.245051
0                no    2.592726

__Franchise vs. Stand-alone: Average Rating__

In [37]:
df.groupby('part_of_franchise').agg({'vote_average':'mean'}).reset_index(drop=False).sort_values(by='vote_average', ascending=False)

  part_of_franchise  vote_average
0                no      6.008787
1               yes      5.956806

## Most Successful Franchises

5. __Find__ the __most successful Franchises__ in terms of

- __total number of movies__
- __total & mean budget__
- __total & mean revenue__
- __mean rating__

In [6]:
def best_franchise_by_criteria(column_name, agg_func, count_return, ascending_boolean):
    df_output = df.groupby('belongs_to_collection').agg({column_name:agg_func}).reset_index(drop=False).sort_values(by=column_name, ascending=ascending_boolean)[0:5]
    return df_output

In [7]:
best_franchise_by_criteria('id', 'count', 5, False)

              belongs_to_collection  id
1259                The Bowery Boys  29
1541                Totò Collection  27
645           James Bond Collection  26
1662  Zatôichi: The Blind Swordsman  26
1267        The Carry On Collection  25

In [8]:
best_franchise_by_criteria('budget_musd', 'sum', 5, False)

                    belongs_to_collection  budget_musd
645                 James Bond Collection      1539.65
551               Harry Potter Collection      1280.00
965   Pirates of the Caribbean Collection      1250.00
1314  The Fast and the Furious Collection      1009.00
1652                     X-Men Collection       983.00

In [9]:
best_franchise_by_criteria('budget_musd', 'mean', 5, False)

                    belongs_to_collection  budget_musd
1199                   Tangled Collection        260.0
1242              The Avengers Collection        250.0
965   Pirates of the Caribbean Collection        250.0
1349                The Hobbit Collection        250.0
796               Man of Steel Collection        237.5

In [10]:
best_franchise_by_criteria('revenue_musd', 'mean', 5, False)

        belongs_to_collection  revenue_musd
112         Avatar Collection   2787.965087
1242  The Avengers Collection   1462.480802
478         Frozen Collection   1274.219009
445   Finding Nemo Collection    984.453213
1349    The Hobbit Collection    978.507785

In [11]:
best_franchise_by_criteria('revenue_musd', 'sum', 5, False)

                    belongs_to_collection  revenue_musd
551               Harry Potter Collection   7707.367425
1157                 Star Wars Collection   7434.494790
645                 James Bond Collection   7106.970239
1314  The Fast and the Furious Collection   5125.098793
965   Pirates of the Caribbean Collection   4521.576826

In [12]:
best_franchise_by_criteria('vote_average', 'mean', 5, False)

                    belongs_to_collection  vote_average
96                        Argo Collection           9.3
184                            Bloodfight           9.0
675   Kenji Misumi's Trilogy of the Sword           9.0
374                             Dreileben           9.0
1677     Алиса в стране чудес (Коллекция)           8.7

## Most Successful Directors

6. __Find__ the __most successful Directors__ in terms of

- __total number of movies__
- __total revenue__
- __mean rating__

In [13]:
def best_director_by_criteria(column_name, agg_func, count_return, ascending_boolean):
    df_output = df.groupby('director').agg({column_name:agg_func}).reset_index(drop=False).sort_values(by=column_name, ascending=ascending_boolean)[0:5]
    return df_output

In [14]:
best_director_by_criteria('id', 'count', 5, False)

               director  id
7955          John Ford  66
11156    Michael Curtiz  65
16800     Werner Herzog  54
610    Alfred Hitchcock  53
16978       Woody Allen  49

In [15]:
best_director_by_criteria('revenue_musd', 'sum', 5, False)

               director  revenue_musd
15438  Steven Spielberg   9256.621422
12859     Peter Jackson   6528.244659
11119       Michael Bay   6437.466781
6846      James Cameron   5900.610310
3802        David Yates   5334.563196

In [16]:
best_director_by_criteria('vote_average', 'mean', 5, False)

                   director  vote_average
1209   Antonis Sotiropoulos          10.0
2084            Brian Skeet          10.0
7832             Joel Heath          10.0
10052         Lukas Bossuyt          10.0
12305        Osman F. Seden          10.0